Extensions/ИнтеграцияGreenApi/InformationRegisters/iga_ЧатыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>iga_ЧатыКлиентов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Чат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.iga_Чаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Catalogs/iga_Чаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>iga_Чаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/CommonModules/iga_ОбработкаДанныхПоЧатамСервер/Ext/Module.bsl
Функция ПолучитьЧатКлиента(Клиент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ЧатыКлиентов.Клиент КАК Клиент,
	               |	iga_ЧатыКлиентов.Чат КАК Чат
	               |ИЗ
	               |	РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
	               |ГДЕ
	               |	iga_ЧатыКлиентов.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Чат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьНомерМесенджера(Клиент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_Чаты.Идентификатор КАК Идентификатор
	               |ИЗ
	               |	РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.iga_Чаты КАК iga_Чаты
	               |		ПО iga_ЧатыКлиентов.Чат = iga_Чаты.Ссылка
	               |ГДЕ
	               |	iga_ЧатыКлиентов.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	Если Выборка.Следующий() Тогда
		
		НормальныйНомер = "7" + Прав(iga_ОбщегоНазначенияКлиентСервер.ТолькоЦифры(Выборка.Идентификатор), 10);
		
		Возврат НормальныйНомер;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Функция ПроверкаНомераТелефона(НомерТелефона) Экспорт
	
	Возврат Новый Структура("Успешно", Истина); //iga_МетодыРаботыСБотом.ПроверитьНомерТелефонаНаВацап(НомерТелефона);
	
КонецФункции

Процедура СохранитьНомерВКонтактнойИнформации(Клиент, НомерТелефона) Экспорт
	
	ЗаписьНомера = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
	ЗаписьНомера.Объект = Клиент;
	ЗаписьНомера.Вид = Константы.iga_ВидКонтактнойИнформацииМесенджера.Получить();
	ЗаписьНомера.Тип = ЗаписьНомера.Вид.Тип;
	ЗаписьНомера.Представление = НомерТелефона;
	ЗаписьНомера.Записать();
	
КонецПроцедуры

Процедура ПривязатьЧатККлиенту(Клиент, ЧатСсылка) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяСвязь = РегистрыСведений.iga_ЧатыКлиентов.СоздатьМенеджерЗаписи();
	НоваяСвязь.Клиент = Клиент;
	НоваяСвязь.Чат = ЧатСсылка;
	НоваяСвязь.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция ПолучитьЧатПоНомеру(НомерТелефона, Клиент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЧатСсылка = iga_МетодыРаботыСБотом.НайтиЧатПоНомеруТелефона(НомерТелефона);
	
	Если ЧатСсылка = Неопределено Тогда
		НовыйЧат = Справочники.iga_Чаты.СоздатьЭлемент();
		НовыйЧат.Наименование = Строка(Клиент) + "("+ НомерТелефона +"@c.us)";
		НовыйЧат.Идентификатор = НомерТелефона +"@c.us";
		НовыйЧат.Записать();
		ЧатСсылка = НовыйЧат.Ссылка;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ВОзврат ЧатСсылка;
	
КонецФункции

Функция ПолучитьЯзыкЧата(ЧатСсылка) Экспорт
	
	Возврат iga_МетодыРаботыСБотом.ПолучитьЗначениеПараметраОбщения(ЧатСсылка, "Язык", Неопределено);
	
КонецФункции

Функция ПолучитьКлиентаПоЧату(Чат) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	iga_ЧатыКлиентов.Клиент КАК Клиент
	               |ИЗ
	               |	РегистрСведений.iga_ЧатыКлиентов КАК iga_ЧатыКлиентов
	               |ГДЕ
	               |	iga_ЧатыКлиентов.Чат = &Чат";
	Запрос.УстановитьПараметр("Чат", Чат);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Клиент;
	КонецЕсли;                 
	
	Возврат Неопределено;
	
КонецФункции
